Ran Plan for dir: `terraform/eventbridge` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/50/default/terraform/eventbridge/crawlinghub-eventbridge-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/50/default/terraform/eventbridge": exit status 1
aws_iam_role.eventbridge_sqs: Refreshing state... [id=crawlinghub-eventbridge-sqs-role-prod]
data.aws_ssm_parameter.eventbridge_trigger_queue_arn: Reading...
data.aws_caller_identity.current: Reading...
data.aws_ssm_parameter.eventbridge_trigger_queue_url: Reading...
aws_cloudwatch_event_rule.crawler_scheduler: Refreshing state... [id=crawlinghub-scheduler-prod]
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.eventbridge_trigger_queue_arn: Read complete after 0s [id=/crawlinghub/sqs/eventbridge-trigger-queue-arn]
data.aws_ssm_parameter.eventbridge_trigger_queue_url: Read complete after 0s [id=/crawlinghub/sqs/eventbridge-trigger-queue-url]
aws_sqs_queue_policy.eventbridge_trigger: Refreshing state... [id=https://sqs.ap-northeast-2.amazonaws.com/646886795421/prod-monitoring-sqs-crawlinghub-eventbridge-trigger]
aws_cloudwatch_event_target.sqs_target: Refreshing state... [id=crawlinghub-scheduler-prod-crawlinghub-sqs-target]
aws_iam_role_policy.eventbridge_sqs: Refreshing state... [id=crawlinghub-eventbridge-sqs-role-prod:crawlinghub-eventbridge-sqs-policy-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_ssm_parameter.eventbridge_role_arn will be created
  + resource "aws_ssm_parameter" "eventbridge_role_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "EventBridge IAM Role ARN for invoking SQS"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/crawlinghub/eventbridge/role-arn"
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "crawlinghub-eventbridge-role-arn-prod"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-eventbridge-role-arn-prod"
          + "Project"     = "crawlinghub"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Error: reading EventBridge Target (crawlinghub-scheduler-prod-crawlinghub-sqs-target): operation error EventBridge: ListTargetsByRule, https response error StatusCode: 400, RequestID: 24a84590-fac1-4f68-b1a7-abfcc519418b, api error AccessDeniedException: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/c62b0fe9d391451c93dfdbd1624188dc is not authorized to perform: events:ListTargetsByRule on resource: arn:aws:events:ap-northeast-2:646886795421:rule/crawlinghub-scheduler-prod because no identity-based policy allows the events:ListTargetsByRule action
│ 
│   with aws_cloudwatch_event_target.sqs_target,
│   on main.tf line 62, in resource "aws_cloudwatch_event_target" "sqs_target":
│   62: resource "aws_cloudwatch_event_target" "sqs_target" {
│ 
╵


```
</details>